%求0-1向量X，Y的联合熵
function H_XY=Interentroy(X,Y)

%X=[0 1 1 0 1 1 1 0 0 0 0 0 1 1 1 1];
%Y=[1 1 1 0 1 0 1 0 1 0 0 0 1 1 0 1];
n=length(X);
XY_00=0;%向量X和Y对应分量中含00的个数
XY_01=0;%向量X和Y对应分量中含01的个数;
XY_10=0;%向量X和Y对应分量中含10的个数;
XY_11=0;%向量X和Y对应分量中含11的个数;
A=X+Y;
B=X-Y;

XY_00=nnz(A==0);
XY_01=nnz(B==-1);
XY_10=nnz(B==1);
XY_11=nnz(A==2);


p_00=XY_00/n;%向量X和Y对应分量中出现00的概率
if p_00==0
   I_00=0;
else
   I_00=-p_00*log(p_00); 
end
p_01=XY_01/n;%向量X和Y对应分量中出现01的概率
if p_01==0
   I_01=0;
else
  I_01=-p_01*log(p_01);  
end
p_10=XY_10/n;%向量X和Y对应分量中出现10的概率
if p_10==0
   I_10=0;
else
  I_10=-p_10*log(p_10); 
end
p_11=XY_11/n;%向量X和Y对应分量中出现11的概率
if p_11==0
   I_11=0;
else
  I_11=-p_11*log(p_11);   
end
H_XY=I_00+I_01+I_10+I_11;
        